/*
 #####################################################################
 # File    : DataBaseCacheClean.h
 # Project : 
 # Created : 2013-03-30
 # DevTeam : thomas only one
 # Author  : thomas
 # Notes   : 清理数据库缓存
 #####################################################################
 ### Change Logs   ###################################################
 #####################################################################
 ---------------------------------------------------------------------
 # Date  : 2016-8-15
 # Author: thomas
 # Notes : 改名 加入获取大小方法
 #
 #####################################################################
 */

//数据库操作
@interface SBDataBaseEvent : NSObject

//获取 TABLE_BIN_VALUE 表中指定数据的总大小
+ (long)getBinSize;

// 执行数据库缓存清理操作
+ (void)cleanAllDBCache;

@end
